export const tableColumns = ["id", "Дата", "Тип", "Клієнт", "Марка", "Модель", "Сума", "Детально"]
export const tableData = [
  {
    'id': 223,
    'дата': "26.06.19",
    'тип': "Легкові та комерційні авто",
    'клієнт': "Иванов В.М.",
    'марка': "Renault",
    'модель': "Dokker",
    'сума': "$11.789",
    'детально': "edit"
  },
  {
    'id': 227,
    'дата': "26.06.19",
    'тип': "СПЕЦІАЛЬНІ ТЗ",
    'клієнт': "Зубенко В.М.",
    'марка': "Ваз",
    'модель': "21.011",
    'сума': "$23.789",
    'детально': "edit"
  },
  {
    'id': 290,
    'дата': "26.06.19",
    'тип': "Вантажні авто",
    'клієнт': "Иванов В.М.",
    'марка': "Djeep",
    'модель': "hunter",
    'сума': "$27.789",
    'детально': "edit"
  },
  {
    'id': 301,
    'дата': "26.01.20",
    'тип': "Обладнання",
    'клієнт': "Иванов В.М.",
    'марка': "Renault",
    'модель': "Dokker",
    'сума': "$23.789",
    'детально': "edit"
  },
  {
    'id': 324,
    'дата': "26.02.20",
    'тип': "Сільгосптехніка",
    'клієнт': "Бабенко Л.Н",
    'марка': "Opel",
    'модель': "Astrra",
    'сума': "$13.789",
    'детально': "edit"
  }
];

export const regions = [
  'Вінницька область',
  'Волинська область',
  'Дніпропетровська область',
  'Донецька область',
  'Житомирська область',
  'Закарпатська область',
  'Запорізька область',
  'Івано-Франківська область',
  'Київська область',
  'Кіровоградська область',
  'Луганська область',
  'Львівська область',
  'Миколаївська область',
  'Одеська область',
  'Полтавська область',
  'Рівненська область',
  'Севастополь',
  'Сумська область',
  'Тернопільська область',
  'Харківська область',
  'Херсонська область',
  'Хмельницька область',
  'Черкаська область',
  'Чернівецька область',
  'Чернігівська область',
]