<p>Добрий день клієнта!</p>
<p>У додатку Ви знайдете:</p>
<div style="padding-left: 15px;">- попереднє комерційну пропозицію по лізингу автомобіля згідно з Вашим запитом {{ model }} {{ mark }} {{ price }}!</div>
<p>Прошу звернути увагу на:</p>
<div style="padding-left: 15px;">- комерційна пропозиція зроблена в грн (Можливо і USD).</div>
<p>У лізингові платежі включені:</p>
<div style="padding-left: 15px;">- всі витрати по реєстрації автомобіля</div>
<div style="padding-left: 15px;">- всі витрати пов'язані зі страхуванням (КАСКО + ОСАГО) на весь термін лізингу</div>
<div style="padding-left: 15px;">- вартість авто</div>
<div style="padding-left: 15px;">- вартість фінансування</div>
<p>Якщо у Вас виникнуть питання, чи готовий приїхати на зустріч - обговорити їх</p>
<p>спасибі</p>
<p>Контакти агента</p>
<p>{{ fio }}</p>
<p>{{ phone }}</p>
<p>{{ email }}</p>
<br />
<p>Прикріплений файл до листа</p>