<template>
  <v-dialog 
    v-model="openDialog" 
    persistent
    max-width="900">
    <v-card>
    <v-card-text class="pt-9 finish-register-agreement">
      <section class="agreement">
        <h5>ДОГОВІР – ОФЕРТА<br />ПРО НАДАННЯ АГЕНТСЬКИЙ ПОСЛУГ</h5>
        <p style="text-indent: 30px;">Цей документ являє собою відкриту пропозицію (Оферту) <b>ТОВАРИСТВО З ОБМЕЖЕНОЮ
        ВІДПОВІДАЛЬНІСТЮ «БЕСТ ЛІЗИНГ»</b>, іменоване надалі «Компанія» щодо укладення Договору про
        надання агентських послуг (далі - Договір) на викладених у цій Оферті умовах.
        Відповідно до ст. 638 Цивільного кодексу України, в разі прийняття викладених в Оферті умов про що
        свідчить надання згоди в електронному кабінеті агента, фізична або юридична особа, яка провадить акцепт цієї
        Оферти, стає Агентом (акцепт Оферти рівнозначний укладенню Договору на умовах, викладених в Оферті)
        онлайн-сервісу електронного документообігу (надалі – Агент).</p>
      </section>

      <section class="agreement">
        <h5>1. ПРЕДМЕТ ДОГОВОРУ</h5>
        <p>1.1. Цим Договором Агент приймає на себе зобов’язання:</p>
        <div class="nested-list">
          <p>- по пошуку та наданню Компанії юридичний та фізичних осіб (в т.ч. суб’єктів підприємницької діяльності) –
          надалі Лізингоодержувачі, які бажають придбати, в т.ч. на умовах фінансового/оперативного лізингу або за
          100% плату за договором купівлі-продажу: автотранспорт (легкові та вантажні з причепами до них, автобуси и
          т.п.), спеціальну техніку (дорожньо-будівельні машини, погрузчики, екскаватори и т.п.), обладнання,
          сільськогосподарську техніку та обладнання, нежилу нерухомість (надалі – Предмет лізингу);</p>
          <p>- ознайомлення Лізингоодержувачів з інформацією про Компанію та умовами надання Компанією лізингових
          послуг;</p>
          <p>- надавати належним чином оформлений пакет документів</p>
        </div>
        <p>1.2. Цим Договором Компанія зобов’язана:</p>
        <div class="nested-list">
          <p>- оперативно розглянути можливість надання Лізингоодержувачам послуги фінансового/оперативного
          лізингу або продажу;</p>
          <p>- в разі позитивного рішення укласти та підписати з Лізингоодержувачами договори фінансового лізингу або
          купівлі-продажу та оплатити Агенту винагороду (в розмірі та порядку, визначеними цим Договором).</p>
        </div>
      </section>

      <section class="agreement">
        <h5>2. ОБОВ`ЯЗКИ СТОРІН</h5>
        <p>2.1. <strong>Агент</strong> зобов’язаний:</p>
        <p>2.1.1. здійснювати пошук Лізингоодержувачів, котрі відповідають наступним критеріям:</p>
        <div class="nested-list">
          <p>- для фізичних осіб – вік яких не перевищує 60 років;</p>
          <p>- для юридичних осіб – є суб’єктами підприємницької діяльності, строк з моменту проведеннядержавної реєстрації котрих більший ніж 1 рік (або за Лізингоодержувача поручається інша
            фізична або юридична особа);</p>
        </div>
        <p>2.1.2. пропонувати Лізингоодержувачам належним чином оформити заяву-анкету на лізинг/
        придбання/купівлі-продажу, сформувати та підготувати необхідний пакет документів, відповідно до вимог
        Компанії;</p>
        <p>2.1.3. здійснювати контроль за правильністю та повнотою заповнення Лізингоодержувачем заявки на лізинг/
        придбання/купівлі-продажу і надання повного пакету документів від Лізингоодержувача (з належним чином
        засвідченими копіями або оригіналами документів);</p>
        <p>2.1.4. узагальнювати надані Лізингоодержувем заповнені заявки на лізинг, перевіряти повноту і правильність
        засвідчення наданих Лізингоодержувачем документів, формувати з них пакет документів і передавати їх
        Компанії (на адресу, вказану в цьому Договорі);</p>
        <p>2.1.5. надавати Компанії Лізингоодержувача (з відповідним документальним оформленням такого подання);
        2.1.6. рекомендувати Лізингоодержувачам звертатися за отриманням повного спектра фінансових послуг до
        Компанії;</p>
        <p>2.1.7. протягом терміну дії цього Договору, щомісячно подавати Компанії не менш одного
        Лізингоодержувача, який бажає отримати від Компанії послугу фінансового лізингу або придбати майно, при
        цьому обов&#39;язково передаючи Компанії заповнену Лізингоодержувачем типову форму заявки та сформований
        пакет документів відповідно до вимог Компанії;</p>
        <p>2.1.8. в разі зміни реквізитів банківського рахунку Агента, який було зазначено в реквізитах звіту,
        відповідно до Типової форми Акту, що є додатком до цього Договору, протягом 10 (десяти) робочих днів з
        моменту підписання Компанією та Лізингоодержувачем договору фінансового лізингу, надати Компанії
        реквізити банківського рахунку для перерахування на нього агентської винагороди відповідно до умов цього
        Договору.</p>
        <p>2.2. <strong>Компанія</strong> зобов’язана:</p>
        <p>2.2.1. забезпечити Агента необхідною інформацією про Компанію, партнерах Компанії, асортимент та
        умови надання лізингових послуг, що викладена на сайті компанії; за письмовим погодженням Сторін
        рекламними матеріалами про Компанію з пропонованими нею лізинговими продуктами (в обсягах, визначених
        Компанією самостійно, без додаткових погоджень з Агентом), новими лізинговими продуктами, впровадженими
        Компанією, акції, які проводяться як Компанією самостійно, так і спільно з партнерами;</p>
        <p>2.2.2. оперативно надавати Агенту усні консультації, пов&#39;язані з предметом цього Договору;</p>
        <p>2.2.3. при необхідності проводити з Агентом періодичні навчальні семінари (в обсягах і регулярністю,
        що визначаються Компанією самостійно, без додаткових погоджень з Агентом);</p>
        <p>2.2.4. за належне надання Агентом Лізингоодержувачів, що відповідають вимогам Компанії та
        підписали договір фінансового лізингу і акт прийому-передачі предмету лізингу оплачувати Агентові агентську
        винагороду в розмірі та порядку, зазначеному в пунктах 7.1.- 7.4. цього Договору.</p>
      </section>

      <section class="agreement">
        <h5>3. ПОРЯДОК ДОКУМЕНТАЛЬНОГО ОФОРМЛЕННЯ НАДАННЯ<br /> АГЕНТОМ ЛІЗИНГООДЕРЖУВАЧА</h5>
        <p>3.1. Надання Компанії Лізингоодержувача вважається належним чином оформленим та, відповідно,
        підлягають оплаті Компанією виключно в разі наявності таких документів:</p>
        <div class="nested-list">
        <p>3.1.1. належним чином заповненої заявки на лізинг/купівлі-продажу від Лізингоодержувача і повного
        пакету належним чином завірених документів Лізингоодержувача відповідно до вимоги Компанії;</p>
        <p>3.1.2. підписаного між Компанією та Лізингоодержувачем договору фінансового лізингу та акту
        прийому-передачі предмету лізингу;</p>
        <p>3.1.3. підписаного та завіреного печатками Сторін Акту про надання Лізингоодержувача та виплату
        агентської винагороди (за формою, зазначеною в Додатку № 1 до цього Договору). У разі відсутності печатки у
        Агента (що підтверджується відповідною письмовою заявою Агента на адресу Компанії), акти та інші
        документи, передбачені цим Договором, оформляються без їх завірення печаткою Агента.</p>
        </div>
      </section>

      <section class="agreement">
        <h5>4. ВІДПОВІДАЛЬНІСТЬ СТОРІН</h5>
        <p>4.1. За неналежне виконання цього Договору, Сторони несуть відповідальність відповідно до чинного
        законодавства України.</p>
      </section>

      <section class="agreement">
        <h5>5. ПОВІДОМЛЕННЯ</h5>
        <p>5.1. Всі повідомлення за цим Договором оформлюються Сторонами в письмовому вигляді і
        відправляються або передаються за адресами Сторін, зазначених у розділі «РЕКВІЗИТИ ТА ПІДПИСИ
        СТОРІН» цього Договору.</p>
      </section>

      <section class="agreement">
        <h5>6. СТРОК ДІЇ ДОГОВОРУ</h5>
        <p>6.1. Оферта набуває чинності з моменту розміщення в мережі Інтернет за адресою:
        <a href="https://agent.bestleasing.com.ua/" target="_blank">https://agent.bestleasing.com.ua/</a> і діє до моменту відкликання Оферти Компанією.</p>
        <p>6.2. Компанія залишає за собою право вносити зміни в умови Оферти та/або відкликати Оферту в будь-
        який момент на власний розсуд. У разі внесення Компанією змін до Оферти, такі зміни вступають в силу з
        моменту розміщення зміненого тексту Оферти на інтернет-сайті за вказаною в п. 6.1 Договору адресою, якщо
        інший строк набрання чинності змінами не визначений додатково при такому розміщенні. Компанія повідомляє
        Агента про зміни в умови Оферти та/або відкликання Оферти через особистий кабінет.</p>
      </section>

      <section class="agreement">
        <h5>7. АГЕНТСЬКА ВИНАГОРОДА</h5>
        <p>7.1. За належне надання Агентом Компанії Лізингоодержувачів, при обов&#39;язковій умові укладення та
        початку практичної реалізації договору фінансового лізингу, Компанія оплачує Агенту агентську винагороду,
        розмір якого визначається Актом про надання Лізингоодержувача та виплату агентської винагороди (за формою,
        зазначеною в Додатку № 1 до цього Договору).</p>
        <p>7.2. Агентська винагорода підлягає оплаті Агенту не раніше ніж: укладення та підписання відповідних
        договорів фінансового лізингу та актів прийому-передачі, та фактична належна оплата Лізингоодержувачем,
        наданим Агентом, авансового лізингового платежу за договором фінансового/оперативного лізингу, укладеними
        між Компанією та Лізингоодержувачем.</p>
        <p>7.3. Оплата агентської винагороди Агенту проводиться в безготівковій формі, шляхом перерахування
        Компанією грошових коштів на рахунок Агента, зазначений в розділі «РЕКВІЗИТИ ТА ПІДПИСИ СТОРІН»
        зазначені в поданому Агентом Акту про надання послуг, що є додатком до цього цього Договору або на
        банківський рахунок Агента, реквізити якого були надані Агентом на підставі пункту 2.1.8. договору. Оплата
        здійснюється не раніше 5 (п&#39;яти) робочих днів з моменту підписання Акту про надання Лізингоодержувача та за
        умови підписання виплату агентської винагороди (за формою, зазначеною в Додатку № 1 до цього Договору).</p>
        <p>7.4. З агентської винагороди, визначеного відповідно до пункту 7.1. цього Договору, Компанія здійснює
        утримання, передбачені чинним законодавством України.</p>
      </section>

      <section class="agreement">
        <h5>8. ЗАКЛЮЧНІ ПОЛОЖЕННЯ</h5>
        <p>8.1. Будь-які зміни і доповнення даного Договору будуть мати юридичну силу лише в тому випадку, якщо вони
        вчинені в письмовій формі та підписані та пропечатані уповноваженими представниками кожної із Сторін. У разі
        відсутності печатки у Агента (що підтверджується відповідною письмовою заявою Агента на адресу Компанії), акти та
        інші документи, передбачені цим Договором, оформляються без їх завірення печаткою Агента.</p>
        <p>8.2. Всі суперечки і розбіжності, які можуть виникнути у зв&#39;язку з виконанням цього Договору, Сторони
        вирішують шляхом переговорів. У разі недосягнення згоди, суперечки між Сторонами будуть передані на розгляд до
        компетентного судового органу України відповідно до чинного законодавства України.</p>
        <p>8.3. Цей Договір складений в 2 (двох) примірниках, по одному для кожної із Сторін. Обидва примірники мають
        однакову юридичну силу.</p>
        <p>8.4. Всі Додатки до Договору є невід&#39;ємною частиною Договору.</p>
      </section>
    </v-card-text>
    <v-card-text class="annex-to-agreement">
      <section class="header">
        <p style="white-space: pre; text-align: right;">
          <b>
          Додаток №1 Типова форма Акту про
          надання Лізингоодержувача та
          виплату агентської винагороди</b>
          до Договору – Оферти
          про надання Агентських послуг
        </p>
      </section>
      <section class="act">
        <h5>Акт про надання Лізингоодержувача та виплату агентської винагороди За договором Оферти про надання Агентських послуг</h5>
        <h5>ТИПОВА ФОРМА</h5>
        <div class="city-year">
          <p style="width: 50%; float: left;"><b>м. Київ</b></p>
          <p style="width: 50%; float: right; text-align: right;">«___ » _<i>[підлягає заповненню]</i>_20__р.</p>
        </div>
        <div class="act-body" style="clear: both;">
          <p>Цей Акт складено для виконання Договору – Оферти про надання Агентських послуг (надалі – Акт),
            укладений між
            <b>ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ «БЕСТ ЛІЗИНГ»</b>, іменоване надалі
            «Компанія», здійснює діяльність на підставі Ліцензії Національної комісії, що здійснює державне регулювання у
            сфері ринків фінансових послуг на надання послуг з фінансового лізингу, в особі Генерального директора
            Золотарьової Людмили Семенівни, яка діє на підставі Статуту, з однієї сторони,<br /> та 
            _______________<i>[підлягає заповненню]</i>____________________________________, (надалі – Агент).<br />
            Ми Сторони, що нижче підписали даний документ, «Компанія», в особі Генерального директора
            Золотарьової Людмили Семенівни, яка діє на підставі Статуту, та «Агент», в особі ______<i>[підлягає заповненню]</i>___
            _______________________________________________, з іншого боку, уклали цей Акт про те, що відповідно до
            Договору надані наступні послуги.</p>
          <p>
            Надано Лізингоодержувачів для збільшення обсягу продажів, надано консультативно-інформаційних
            послуги клієнтам, підписано Договорів фінансового лізингу (сплачено авансові платіжі) та Акти прийому-
            передачі Предметів лізингу з наступними Лізингоодержувачами: </p>
          <div style="padding-bottom: 1rem;">
            <table>
              <tbody>
                <tr>
                  <td>№</td>
                  <td>Лізингоодержувач</td>
                  <td>№ та дата Договору ФЛ</td>
                  <td>Вартість предмету лізингу, грн.</td>
                  <td>Дата передачі Предмету лізингу</td>
                </tr>
                <tr>
                  <td>1.</td>
                  <td>&nbsp;</td>
                  <td>&nbsp;</td>
                  <td>&nbsp;</td>
                  <td>&nbsp;</td>
                </tr>
              </tbody>
            </table>
          </div>
          <p>У Компанії до Агента претензій до якості наданих послуг немає.</p>
          <p>За надання послуг за Договором Компанія нараховує і сплачує Комісію на рахунок, вказаний в розділі
            «РЕКВІЗИТИ ТА ПІДПИСИ СТОРІН» в цьому Акті Агенту (в порядку і строки, зазначені в Договорі) в розмірі:
            <i>[підлягає заповненню]</i> (_<i>[підлягає заповненню]</i>_ грн. ____ коп.) гривень, в т.ч. військовий збір та податок на прибуток з
            фізичних осіб.</p>
          <p>Цей Акт складено у двох оригінальних примірниках, по одному кожній із Сторін.</p>
          <h5>РЕКВІЗИТИ ТА ПІДПИСИ СТОРІН:</h5>
          <div class="signers">
            <div style="float: left; width: 50%;">
              <h5 style="padding: 0;">
                <span style="text-decoration: underline;">КОМПАНІЯ:</span><br />
                ТОВАРИСТВО З ОБМЕЖЕНОЮ
                ВІДПОВІДАЛЬНІСТЮ «БЕСТ ЛІЗИНГ»
              </h5>
              <div style="display: flex; justify-content: center;">
                <div>
                  Місцезнаходження: 01054, м. Київ, вул. Ярославів<br />
                  Вал 13/2 літера «Б»<br />
                  Адреса для листування та обслуговування :<br />
                  03038 Україна, м. Київ, вул. Лінійна, буд. 17<br />
                  п/р 26508010087761 в АТ &quot;Укрексімбанк&quot; МФО
                  322313<br />
                  Індивідуальний податковий номер 338803526504
                  <p>Генеральний директор</p>
                  ___________________ Л.С. Золотарьова
                </div>
              </div>
            </div>
            <div style="float: right; width: 50%;">
              <h5 style="padding: 0; text-decoration: underline;">АГЕНТ:</h5>
            </div>
          </div>
        </div>
      </section>
    </v-card-text>
    <v-card-text style="padding-bottom: 0px; clear: both; padding-top: 50px;">
      <div class="d-flex justify-center">
        <span>
          <v-btn
            @click="closeDialog()" 
            color="grey darken-4"
            :loading="loading"
            dark small>
            Ознайомлений
          </v-btn>
        </span>
      </div>
      <div>
        <v-card-text class="accept-wrapper">
          <p class="accept-agreement-rule">Здійснюючи акцепт цієї Оферти, Замовник погоджується з усіма умовами Договору в 
          тому вигляді, в якому вони викладені в тексті цієї Оферти. Цей Договір має юридичну силу і є 
          рівнозначним (рівносильним) договору, підписаному Сторонами.</p>
        </v-card-text>
      </div>
    </v-card-text>
    </v-card>
  </v-dialog>
</template>

<script>
export default {
  props: ['showAgreement'],
  data: () => ({
    openDialog: false,
    user_id: null,
    loading: false,
  }),
  methods: {
    closeDialog() {
      this.loading = true
      setTimeout(() => {
        this.loading = false
        this.$emit('closeDialog', true)
      }, 700)
    }
  },
  watch: {
    showAgreement(val) {
      this.openDialog = val
    }
  },
  mounted() {
    this.openDialog = this.showAgreement
  }
}
</script>

<style lang="scss">
.finish-register-agreement {
  .agreement {
    h5 {
      text-align: center;
      font-weight: bold;
    }
    .nested-list {
      padding-left: 15px;
    }
    p {
      margin-bottom: 13px;
    }
  }
}

.accept-wrapper {
  .accept-agreement-rule {
    font-size: 0.821rem;
    padding-top: 10px;
    padding-left: 4rem;
    padding-right: 4rem;
    text-align: center;
    color: rgba(0, 0, 0, 0.473)
  }
}

.annex-to-agreement {
  .header {
    display: inline-block; 
    float: right; 
  }
  .act {
    clear: both;
    .act-body {
      p {
        text-indent: 3rem;
      }
      table, th, td {
        border: 1px solid black;
      }
      th, td {
        padding: 5px 15px;
        text-align: center;
      }
    }
    h5 {
      font-weight: bold; 
      padding: 0 5rem; 
      text-align: center;
    }
  }
}
</style>